Revit 2027 API
FamilyInstance.StructuralUsage Property
Provides the primary structural usage of the instance, such as brace, girder etc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralInstanceUsage StructuralUsage { get; set; }
Public Property StructuralUsage As StructuralInstanceUsage
	Get
	Set
public:
property StructuralInstanceUsage StructuralUsage {
	StructuralInstanceUsage get ();
	void set (StructuralInstanceUsage value);
}
member StructuralUsage : StructuralInstanceUsage with get, set
Property Value
StructuralInstanceUsage
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace